Repository: JyotiPrakash004/TeraFarmREC
Catalog: lib/l10n/app_*.arb
Languages: ta, te

# appTitle
source: AgriGuru Farm AI
ta: அக்ரிகுரு பண்ணை ஏஐ
te: అగ్రిగురు ఫామ్ ఏఐ

# searchHint
source: Search
ta: தேடு
te: శోధించండి

# buyDirect
source: Buy directly from farms
ta: பண்ணையிலிருந்தே நேரடியாக வாங்குங்கள்
te: ఫార్మ్ నుండి నేరుగా కొనండి

# noFarms
source: No farms found.
ta: பண்ணைகள் எதுவும் கிடைப்பதில்லை.
te: ఏ ఫారమ్‌లు కనబడవు.

source: Buyer
ta: வாங்குபவர்
te: కొనుగోలుదారు

source: Farmer
ta: சமத்துக்கு
te: వ్యవసాయుడు

source: AI
ta: ஏஐ
te: ఏఐ

source: Fetching location...
ta: அருகிலுள்ள இடத்தை பெற்று வருகின்றது...
te: స్థానం తీసుకుంటోంది...

source: Price: Low to High
ta: விலை: குறைந்தது அதிகமாக
te: విలయం: తక్కువ నుంచి ఎక్కువ

# scaleLabel
source: Scale:
ta: அளவு:
te: పరిమాణం:

source: Unnamed Farm
ta: பெயரிடாத பண்ணை
te: పేరు లేని వ్యవసాయం

source: No description
ta: விளக்கம் இல்லை
te: వివరణ లేదు

source: Dashboard
ta: டாஷ்போர்ட்
te: డ్యాష్‌బోర్డ్

source: Daily Tasks
ta: தினசரி பணிகள்
te: ప్రతిరోజు కార్యాలు

source: Orders
ta: ஆர்டர்கள்
te: ఆర్డర్లు

source: Sustainable Farming
ta: தொடர்பான வேளாண்மை
te: స్థిరపరచుకొన్న వ్యవసాయం

source: Community
ta: சமூகத்தலைமை
te: సముదాయం

source: Shop
ta: கடை
te: కొనుగోలు

source: Crop Suggestion
ta: பயிர் பரிந்துரை
te: పంట సూచన

source: Market Price Analysis
ta: சந்தை விலை பகுப்பு
te: బజార్ ధర విశ్లేషణ

# listFarm
source: List a Farm
ta: பண்ணை பட்டியலிடு
te: ఫారం జాబితా చేయండి

# growPlant
source: Grow a Plant
ta: வளர்த்தெடு
te: మొక్క పెంచండి

# aiPageTitle
source: Tera AI
ta: டெரா ஏஐ
te: టెరా ఏఐ

source: Tera Care AI
ta: டெரா கேர் ஏஐ
te: టెరా కేర్ ఏఐ

source: Tera Doc AI
ta: டெரா டாக் ஏஐ
te: టెరా డాక్ ఏఐ

source: Tera Recommend AI
ta: டெரா பரிந்துரை ஏஐ
te: టెరా సిఫార్సులు ఏఐ

# productPageTitle
source: Products
ta: பொருட்கள்
te: ఉత్పత్తులు

source: Farm not found.
ta: பண்ணை கிடைக்கவில்லை.
te: ఫారం కనబడలేదు.

# distanceChargeLabel
source: distance charge
ta: தூரச் கட்டணம்
te: దూర ఛార్జ్

source: Available products
ta: கிடைக்கும் பொருட்கள்
te: అందుబాటులో ఉత్పత్తులు

source: kg Each unit
ta: கிலோக்கு ஒவ்வொன்றாக
te: కిలో ప్రతి యూనిట్

source: Buy Now
ta: இப்போது வாங்கவும்
te: ఇప్పుడు కొనండి

# ordersPageTitle
source: Orders
ta: ஆர்டர்கள்
te: ఆర్డర్లు

source: Pending requests
ta: மின்றிய கோரிக்கைகள்
te: ఫలితం రాలేదు

source: No pending orders.
ta: எந்தவுமில்லை.
te: లేనిది.

# historyTitle
source: History
ta: வரலாறு
te: చరిత్ర

source: No completed orders.
ta: முடிந்த ஆர்டர்கள் இல்லை.
te: పూర్తయిన ఆర్డర్లు లేవు.

# locationLabel
source: Location
ta: இடம்
te: ప్రాంతం

# deliveryLabel
source: Delivery
ta: விநியோகி
te: డెలివరీ

source: Accept
ta: ஏற்கவும்
te: ఆమోదించండి

source: Reject
ta: நிராகரிக்கவும்
te: నిరాకరించండి

source: Delivered
ta: விநியோகிக்கப்பட்டது
te: డెలివర్ చేయబడింది

source: Cancelled
ta: ரத்து செய்யப்பட்டது
te: రద్దు చేయించారు

# addProductPageTitle
source: Add Product
ta: பொருள் சேர்க்கவும்
te: ఉత్పత్తి జోడించండి

# productNameLabel
source: Product Name
ta: பொருளின் பெயர்
te: ఉత్పత్తి పేరు

# priceLabel
source: Price
ta: விலை
te: విలువు

# categoryLabel
source: Category
ta: வகை
te: వర్గం

# categoryVegetables
source: Vegetables
ta: காய்கறிகள்
te: కూరగాయల

# categoryFruits
source: Fruits
ta: பழங்கள்
te: పండ్లు

# categoryHerbs
source: Herbs
ta: மேல்மருந்துகள்
te: ఆవిష్కరణలు

# descriptionLabel
source: Description
ta: விவரம்
te: వివరణ

# addProductButton
source: + Add Product
ta: + பொருள் சேர்க்க
te: + ఉత్పత్తి జోడించండి

# productAddedMessage
source: Product Added!
ta: பொருள் சேர்க்கப்பட்டது!
te: ఉత్పత్తి జోడించబడింది!

# farmDashboardTitle
source: Farm Dashboard
ta: பண்ணைவலை அலகு
te: ఫారమ్ డాష్‌బోర్డు

source: Total Earnings
ta: மொத்த வருமானம்
te: మొత్తం ఆదాయం

# viewPlantAnalysis
source: View Plant Growth Analysis
ta: இயற்கை வளர்ச்சி பகுப்பு
te: ప్లాంట్ అభివృద్ధి విశ్లేషణ

# loading
source: Loadingâ€¦
ta: ஏற்றுகிறது…
te: లోడ్ అవుతోంది…

source: Error
ta: பிழை
te: లోపం

source: No Data
ta: தரவு இல்லை
te: డేటా లేదు

source: Your Farm
ta: உங்கள் பண்ணை
te: మీ ఫారం

# noFarmRegistered
source: No farm registered by you.
ta: உங்கள் பண்ணை பதிவுசெய்யப்படவில்லை.
te: మీరు ఏ ఫారం నమోదు చేయలేదు.

source: Product Listings
ta: பொருள் பட்டியல்
te: ఉత్పత్తుల జాబితా

source: No products found.
ta: பொருட்கள் கிடைப்பதில்லை.
te: ఉత్పత్తులు కనబడలేదు.

# tableCrop
source: Crop
ta: பயிர்
te: ఫసలు

# tableStock
source: Stock
ta: சரக்கு
te: స్టాక్

# tablePricePerKg
source: Price per Kg
ta: கிலோக்கு விலை
te: ప్రతి కిలో ధర

# accountPageTitle
source: Account
ta: சுயவிவரப் பக்கம்
te: ఖాతా

source: Error loading profile
ta: சுயவிவரம் ஏற்றலில் பிழை
te: ప్రొఫైల్‌లో లోపం

# defaultEmail
source: example@email.com
ta: எடுத்துக்காட்டு@மின்னஞ்சல்.com
te: ఉదాహరణ@ఈమెయిల్.com

# defaultUserName
source: User Name
ta: பயனர் பெயர்
te: వినియోగదారు పేరు

# buyerSellerLabel
source: Buyer / Seller
ta: வாங்குபவர் / விற்பனையாளர்
te: కొనుగోలుదారు / అమ్మకందారుడు

# levelLabel
source: Lvl
ta: நிலை
te: స్థాయి

# xpLabel
source: XP
ta: எக்ஸ்பி
te: ఎక్స్‌పీ

source: My Orders
ta: எனது ஆர்டர்கள்
te: నా ఆర్డర్లు

source: Badges
ta: பேட்ஜ்கள்
te: బ్యాడ్జ్‌లు

source: My Addresses
ta: எனது முகவரிகள்
te: నా చిరునామాలు

source: My List
ta: எனது பட்டியல்
te: నా జాబితా

source: Log out
ta: வெளியேறு
te: లాగ్ అవుట్

# levelRoadmapTitle
source: Level Roadmap
ta: நிலை வரைபடம்
te: స్థాయి రోడ్‌మ్యాప్

source: Reward: To be announced
ta: பரிசு: அறிவிக்கப்பட உள்ளது
te: రివార్డు: ప్రకటించబడుతుంది

# eatHealthy
source: Eat what makes you healthy
ta: அருகிலுள்ள சுவையானது சாப்பிடு
te: మీ ఆరోగ్యానికి ప్రియమైనవి తింటారు

source: Farms around you
ta: உங்கள் சுற்றிலுள்ள பண்ணைகள்
te: మీ చుట్టూ ఫారమ్స్

source: No farms found.
ta: பண்ணைகள் எதுவும் கிடைக்கவில்லை.
te: ఏ ఫారం కనబడలేదు.

# navHome
source: Home
ta: முகப்பு
te: హోమ్

# navCommunity
source: Community
ta: சமூகம்
te: కమీ్యూనిటీ

# navBuy
source: Buy
ta: வாங்க
te: కొనుగోలు

# navShop
source: Shop
ta: கடை
te: షాపు

# catOnion
source: Onion
ta: வெங்காயம்
te: ఉల్లిపాయ

# catTomato
source: Tomato
ta: தக்காளி
te: టమోటా

# catBeans
source: Beans
ta: பீன்ஸ்
te: బీన్స్

# catGreens
source: Greens
ta: பச்சைக் கிழங்கு
te: ఆకులోకులు

source: My community
ta: என் சமூகம்
te: నా కమ్యూనిటీ

source: Leaderboard
ta: லீடர்போர்ட்
te: లీడర్బోర్డ్

source: Collab
ta: கூட்டு
te: కోలాబ్

source: Forum
ta: மன்றம்
te: ఫోరం

# navDashboard
source: Dashboard
ta: டாஷ்போர்டு
te: డాష్‌బోర్డు

# editFarmTitle
source: Edit Farm
ta: பண்ணையை திருத்து
te: ఫారం సవరించండి

source: Change Image
ta: படத்தை மாற்று
te: చిత్రం మార్చండి

source: Farm data not found.
ta: பண்ணை தரவு கிடைக்கவில்லை.
te: ఫారం డేటా కనబడలేదు.

# errorLoadingFarmData
source: Error loading farm data: {error}
ta: தரவு ஏற்றலில் பிழை: {error}
te: లోడ్ లోపం: {error}

# errorPickingImage
source: Error picking image: {error}
ta: படம் தேர்வதில் பிழை: {error}
te: చిత్రం ఎంచడంలో లోపం: {error}

# errorUploadingImage
source: Error uploading image: {error}
ta: படம் பதிவேற்றுவதில் பிழை: {error}
te: చిత్రాన్ని అప్‌లోడ్ చేయడంలో లోపం: {error}

# farmUpdatedSuccess
source: Farm updated successfully!
ta: பண்ணை வெற்றிகரமாக புதுப்பிக்கப்பட்டது!
te: ఫారం విజయవంతంగా నవీకరించబడింది!

# farmNameLabel
source: Farm Name
ta: தொட்டுப்பயிர் பெயர்
te: వ్యవసాయ పేరు

# contactNumberLabel
source: Contact Number
ta: தொடர்பு எண்
te: సంప్రదింపు సంఖ్య

# farmDescriptionLabel
source: Farm Description
ta: பயிர் விளக்கம்
te: వ్యవసాయ వివరణ

# scaleSmall
source: Small Scale
ta: சிறிய அளவு
te: చిన్న పరిమాణం

# scaleLarge
source: Large Scale
ta: பெரிய அளவு
te: పెద్ద పరిమాణం

# productsLabel
source: Products:
ta: பொருட்கள்:
te: ఉత్పత్తులు:

source: Product {index}
ta: பொருள் {index}
te: ఉత్పత్తి {index}

# cropNameLabel
source: Crop Name
ta: பயிர் பெயர்
te: పంట పేరు

# stockLabel
source: Stock
ta: சேமிப்பு
te: స్టాక్

# pricePerKgLabel
source: Price per kg
ta: கிலோவுக்கு விலை
te: కిలోకి ధర

source: Remove Product
ta: பொருள் நீக்கு
te: ఉత్పత్తి తీసివేయి

source: Add Product
ta: பொருள் சேர்
te: ఉత్పత్తి జోడించండి

# updateFarmButton
source: Update Farm
ta: பண்ணை புதுப்பி
te: ఫారం నవీకరించండి

# errorEnterFarmName
source: Please enter a farm name
ta: தயவு செய்து பயிர் பெயரை உள்ளிடவும்
te: దయచేసి వ్యవసాయ పేరు నమోదు చేయండి

# errorEnterLocation
source: Please enter a location
ta: தயவு செய்து இடத்தை உள்ளிடவும்
te: దయచేసి ప్రాంతాన్ని నమోదు చేయండి

# errorEnterContact
source: Please enter a contact number
ta: தயவு செய்து தொடர்பு எண்ணை உள்ளிடவும்
te: దయచేసి సంప్రదింపు సంఖ్య నమోదు చేయండి

# errorEnterDescription
source: Please enter a farm description
ta: தயவு செய்து விளக்கத்தை உள்ளிடவும்
te: దయచేసి వివరణను నమోదు చేయండి

# errorEnterCropName
source: Please enter crop name
ta: தயவு செய்து பயிர் பெயரை உள்ளிடவும்
te: దయచేసి పంట పేరు నమోదు చేయండి

# errorEnterStock
source: Please enter stock
ta: தயவு செய்து சேமிப்பை உள்ளிடவும்
te: దయచేసి స్టాక్ నమోదు చేయండి

# errorEnterPrice
source: Please enter price
ta: தயவு செய்து விலையை உள்ளிடவும்
te: దయచేసి ధరను నమోదు చేయండి

# usernameLabel
source: Username
ta: பயனர்பெயர்
te: వినియోగదారు పేరు

# emailLabel
source: My email Address
ta: என் மின்னஞ்சல் முகவரி
te: నా ఇమెయిల్ చిరునామా

# phoneLabel
source: Phone number
ta: தொலைபேசி எண்
te: ఫోన్ నంబర్

# localityLabel
source: Locality
ta: இருமுறை
te: ప్రాంతం

# saveButton
source: Save
ta: சேமி
te: సేవ్ చేయండి

# errorEmptyField
source: This field cannot be empty
ta: இது காலியாக இருக்க முடியாது
te: ఈ ఫీల్డ్ ఖాళీగా ఉండకూడదు

# errorUploadingProfileImage
source: Error uploading profile image: {error}
ta: பதிவேற்றதில் பிழை: {error}
te: చేపట్టడంలో లోపం: {error}

# profileUpdatedSuccess
source: Profile updated successfully!
ta: சுயவிவரம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது!
te: ప్రొఫైల్ విజయవంతంగా నవీకరించబడింది!

# errorSavingProfile
source: Error saving profile: {error}
ta: சுயவிவரம் சேமிப்பதில் பிழை: {error}
te: ప్రొఫైల్ భద్రపరిచే లోపం: {error}

# growPlantTitle
source: Grow a Plant
ta: ஒரு செடியை வளப்படுத்தவும்
te: మొక్కను పెంచండి

# cropStageLabel
source: Crop Stage
ta: வளர்ச்சி நிலை
te: పంట దశ

# cityLabel
source: City
ta: நகர்
te: నగరం

# registerPlantButton
source: Register Plant
ta: செடியை பதிவு செய்
te: మొక్క నమోదు చేయండి

# plantRegisteredSuccess
source: Plant registered successfully!
ta: செடி வெற்றிகரமாக பதிவு செய்யப்பட்டது!
te: మొక్క విజయవంతంగా నమోదు అయింది!

# errorSelectStage
source: Please select a crop stage
ta: தயவு செய்து வளர்ச்சி நிலையை தேர்ந்தெடுக்கவும்
te: దయచేసి దశను ఎంచుకోండి

# errorEnterCity
source: Please enter the city
ta: தயவு செய்து நகரத்தை உள்ளிடவும்
te: దయచేసి నగరాన్ని నమోదు చేయండి

# stageSeed
source: Seed
ta: விதை
te: బీజం

# stageSapling
source: Sapling
ta: முழுக்கம்
te: చిక్కుడు

# stageBud
source: Bud
ta: முதுகு
te: కొమ్మ

# stageFlower
source: Flower
ta: மலர்
te: పువ్వు

# stageFruit
source: Fruit
ta: பழம்
te: పండు

# leaderboardTitle
source: Leaderboard
ta: முன்னணி பட்டியல்
te: లీడర్బోర్డ్

# tabGlobal
source: Global
ta: உலகளாவிய
te: గ్లోబల్

# tabLocal
source: Local
ta: உள்ளூர்
te: లోకల్

source: Error loading leaderboard
ta: முன்னணி பட்டியல் ஏற்றலில் பிழை
te: లీడర్బోర్డ్ లోడ్ లోపం

# unknownUser
source: Unknown
ta: அனுபவமற்றவர்
te: తెలియని

# youLabel
source: You
ta: நீங்கள்
te: మీరు

# listFarmTitle
source: List a Farm
ta: செய்கையாளர் பட்டியல்
te: వ్యవసాయాన్ని జాబితా చేయండి

# uploadImageHint
source: Please upload a square image:
ta: தயவு செய்து ஒரு சதுரப் படம் பதிவேற்றவும்:
te: దయచేసి ఒక చతురస్ర చిత్రం అప్‌లోడ్ చేయండి:

source: No image selected.
ta: படம் தேர்ந்தெடுக்கப்படவில்லை.
te: ఏ చిత్రాన్ని ఎంచుకోలేదు.

# chooseFileButton
source: Choose File
ta: கோப்பு தேர்ந்தெடு
te: ఫైలు ఎంచుకోండి

# fileChosenLabel
source: File Chosen
ta: கோப்பு தேர்ந்தெடுக்கப்பட்டது
te: ఫైలు ఎంచుకోబడింది

# productDetailsLabel
source: Product Details:
ta: பொருள் விவரங்கள்:
te: ఉత్పత్తి వివరాలు:

# removeProductButton
source: Remove
ta: நீக்கு
te: తీసివేయి

# createFarmButton
source: Create a Farm
ta: தொட்டுப்பயிர் உருவாக்கு
te: వ్యవసాయాన్ని సృష్టించండి

# farmCreatedSuccess
source: Farm created successfully!
ta: தொட்டுப்பயிர் வெற்றிகரமாக உருவாக்கப்பட்டது!
te: వ్యవసాయం విజయవంతంగా సృష్టించబడింది!

# errorSavingFarm
source: Error saving farm details: {error}
ta: தொட்டுப்பயிர் விவரங்களை சேமிப்பதில் பிழை: {error}
te: వ్యవసాయ వివరాలు భద్రపరిచే సమయంలో లోపం: {error}

source: Account
ta: சுயவிவரம்
te: అక్కౌంట్

source: Home
ta: முகப்பு
te: హోమ్

source: Farm
ta: பண்ணை
te: ఫారం

source: User Name
ta: பயனர் பெயர்
te: వినియోగదారు పేరు

# teradocTitle
source: Teradoc Plant Health Analyzer
ta: டெராடாக் தாவர சுகாதார பகுப்பாய்வாளர்
te: టెరాడాక్ మొక్క ఆరోగ్య విశ్లేషకుడు

source: Camera
ta: கேமரா

source: Gallery
ta: கேலரி
te: గ్యాలరీ

source: No analysis yet.
ta: இன்னும் பகுப்பாய்வு இல்லை.
te: ఇంతవరకు విశ్లేషణ లేదు.

# teradocWarning
source: Warning: This application is designed exclusively for plant health analysis. Uploading images that do not depict plants may yield irrelevant or inaccurate results. Please upload only images of plants.
ta: எச்சரிக்கை: இது தாவர சுகாதார பகுப்பாய்விற்கே வடிவமைக்கப்பட்டுள்ளது. தாவரங்கள் அல்லாத படங்களை பதிவேற்றுவது பொருந்தாத அல்லது தவறான முடிவுகளை தரலாம். தயவுசெய்து தாவரங்களின் படங்களை மட்டுமே பதிவேற்றவும்.
te: జాగ్రత్త: ఈ అప్లికేషన్ మొక్కల ఆరోగ్య విశ్లేషణకు మాత్రమే రూపొందించబడింది. మొక్కల్ని సూచించనివి చిత్రాలను అప్‌లోడ్ చేస్తే అనవసర లేదా అప్రమాణ ఫలితాలు రావచ్చు. దయచేసి కేవలం మొక్కల చిత్రాలను upload చేయండి.

# teradocPrompt
source: You are Teradoc, the plant doctor. Analyze the health of the plant in the provided image, identify any diseases, and provide necessary treatment recommendations.
ta: நீங்கள் டெராடாக், தாவர மருத்துவர். வழங்கப்பட்ட படத்தில் தாவரத்தின் ஆரோக்கியத்தைக் கணிக்கவும், எந்த நோய்களையும் கண்டறிந்து, தேவையான சிகிச்சைக் கூறுகளை வழங்கவும்.
te: మీరు టెరాడాక్, మొక్క వైద్యుడు. అందించిన చిత్రంలో మొక్కల ఆరోగ్యాన్ని విశ్లేషించండి, ఏవైనా వ్యాధులను గుర్తించండి, మరియు అవసరమైన చికిత్స సూచనలు ఇవ్వండి.

# errorAnalyzing
source: Error analyzing image: {error}
ta: பகுப்பாய்வில் பிழை: {error}
te: విశ్లేషణలో లోపం: {error}

source: Enter City
ta: நகரத்தை உள்ளிடவும்
te: నగరం నమోదు చేయండి

source: Get Weather
ta: வானிலை பெறவும்
te: వాతావరణం పొందండి

# fetchWeatherFirst
source: Please fetch weather first.
ta: முதலில் வானிலை பெறவும்.
te: దయచేసి ముందుగా వాతావరణాన్ని పొందండి.

# enterPlant
source: Enter Plant Name
ta: புதிர் பெயரை உள்ளிடவும்
te: పంట పేరును నమోదు చేయండి

# getTips
source: Get Sustainable Tips
ta: நிலைத்திருக்கும் குறிப்புகள் பெறவும்
te: స్టెయినబుల్ టిప్స్ పొందండి

# tryAnother
source: Try Another Plant
ta: மறு முயற்சி செய்க
te: మరోసారి ప్రయత్నించండి

# translationInstruction
source: Translate the following text while preserving meaning:
ta: பின்வரும் உரையை மொழிபெயர்க்கவும், பொருள் மாறாமிருக்கும் வடிவில்:
te: కిందివున్న వచనం ను అనువాదం చేయండి, అర్ధం అదే ఉండేలా:
